phatware/canres/da1469X/SDK_10.0.12.146/config/embsys/Dialog_Semiconductor/DA1469x-00.xml
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000bb</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>BIAS_VREF_RF2_SEL</name>
	<description>same coding as BIAS_VREF_RF1_SEL.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BIAS_VREF_RF1_SEL</name>
	<description>Vref_code | Vref_Voltage (mV)
0:900
1:930
2:960
3:990
4:1020
5:1050
6:1080
7:1110
8:1140
9:1170
10:1200
11:1230
12:1260
13:1290
14:1320
15:1350</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_CTRL_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0001fc80</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>BOD_V14_RST_EN</name>
	<description>If set, generate power-on reset on channel V14</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18F_RST_EN</name>
	<description>If set, generate power-on reset on channel V18F</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VDD_RST_EN</name>
	<description>If set, generate power-on reset on channel VDD</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18P_RST_EN</name>
	<description>If set, generate power-on reset on channel V18P</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18_RST_EN</name>
	<description>If set, generate power-on reset on channel V18</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V30_RST_EN</name>
	<description>If set, generate power-on reset on channel V30</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VBAT_RST_EN</name>
	<description>If set, generate power-on reset on channel VBAT</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V14_EN</name>
	<description>Enable brown-out detection for channel V14</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18F_EN</name>
	<description>Enable brown-out detection for channel V18F</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VDD_EN</name>
	<description>Enable brown-out detectionfor channel VDD</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18P_EN</name>
	<description>Enable brown-out detectio for channel V18P</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18_EN</name>
	<description>Enable brown-out detectionfor channel V18</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V30_EN</name>
	<description>Enable brown-out detection for channel V30</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VBAT_EN</name>
	<description>Enable brown-out detectionfor channel VBAT</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_STATUS_CLEAR</name>
	<description>Clears the brownout status register</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_CLK_DIV</name>
	<description>Brown-out detector clock divider.
0x0: BOD_CLK/1
0x1: BOD_CLK/2
0x2: BOD_CLK/4
0x3: BOD_CLK/8 (BOD_CLK = 1MHz)</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_LVL_CTRL0_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x041e0eaf</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>BOD_LVL_V18</name>
	<description>Brown-out detection level for V18; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[26:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_LVL_V30</name>
	<description>Brown-out detection level for V30; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[17:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_LVL_VBAT</name>
	<description>Brown-out detection level for VBAT; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.5*(1.2 * (BOD_LVL+1)/192)</description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_LVL_CTRL1_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00df0107</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>BOD_LVL_VDD_RET</name>
	<description>Brown-out detection level for VDD in sleep; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[24:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_LVL_VDD_ON</name>
	<description>Brown-out detection level for VDD in active; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[16:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_LVL_V18P</name>
	<description>Brown-out detection level for V18P; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_LVL_CTRL2_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00018f07</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>BOD_LVL_V14</name>
	<description>Brown-out detection level for V14; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[17:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_LVL_V18F</name>
	<description>Brown-out detection level for V18F; disable the bod channel before adjusting the level setting.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_STATUS_REG</name>
	
