phatware/canres/da1469X/SDK_10.0.12.146/config/embsys/Dialog_Semiconductor/DA1469x-00.xml
For the JDI parallel interface should be used the format :
0x0A : RGB222</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_DBIB_CMD_REG</name>
	<description>MIPI DBIB Command Register</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_DBIB_CMD_SEND</name>
	<description>Send command to the DBI interface</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_CMD_STORE</name>
	<description>This bit has meaning only when LCDC_DBIB_CFG_REG[LCDC_DBIB_SPI_JDI] = 1. When is enabled, stores the LCDC_DBIB_CMD_VAL to the register that keeps the Y position. </description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_CMD_VAL</name>
	<description>Data to send to the DBI interface</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_FRONTPORCHXY_REG</name>
	<description>Front Porch X and Y</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_FPORCH_X</name>
	<description>Front porch X (lines)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_FPORCH_Y</name>
	<description>Front porch Y (pixel clocks)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_GPIO_REG</name>
	<description>General Purpose IO (2-bits)</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_TE_INV</name>
	<description>Applies an inversion on the TE (tearing effect) signal.
0 : the inversion is not applied on the TE signal
1 : the inversion is applied on TE signal</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_PARIF_SEL</name>
	<description>Selection of the parallel interface type that is forwarded to the gpio pins.
0 : JDI interface signals
1 : Clasic parallel interface</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_IDREG_REG</name>
	<description>Identification Register</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x87452365</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_ID</name>
	<description>Identification register</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_INTERRUPT_REG</name>
	<description>Interrupt Register</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_IRQ_TRIGGER_SEL</name>
	<description>IRQ trigger control
0: Level triggering
1: Edge triggering
In the case of the level triggering, the request remains active in the LCDC until to be cleared. The request can be cleared by performing a write access in the LCDC_INTERRUPT_REG. This is not required in the case of the edge triggering.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_FRAME_END_IRQ_EN</name>
	<description>Continuous mode: frame end. Single mode: frame end or idle.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_TE_IRQ_EN</name>
	<description>TE interrupt enable. See also the configuration bit LCDC_DBIB_CFG_REG[LCDC_DBIB_TE_DIS]</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_HSYNC_IRQ_EN</name>
	<description>HSYNC interrupt enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_VSYNC_IRQ_EN</name>
	<description>VSYNC or TE interrupt enabled. See also the configuration bit LCDC_DBIB_CFG_REG[LCDC_DBIB_TE_DIS] for the TE signal.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_END_HLINE_REG</name>
	<description>ENB end horizontal line</description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_ENB_END_HLINE</name>
	<description>The number of the last horizontal line where the ENB signal is asserted</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_START_CLK_REG</name>
	<description>ENB start delay</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_ENB_START_CLK</name>
	<description>Defines the number of the HCK half periods that should take place after a transtion in the VCK and before to be enabled of the ENB. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_START_HLINE_REG</name>
	<description>ENB start horizontal line</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_ENB_START_HLINE</name>
	<description>The number of the first horizontal line where the ENB signal is asserted</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_WIDTH_CLK_REG</name>
	<description>ENB width</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_ENB_WIDTH_CLK</name>
	<description>ENB (high) width in HCK half periods</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_FBX_BLANKING_REG</name>
	<description>Horizontal front/back blanking (hck half periods)</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_FXBLANKING</name>
	<description>Horizontal front blanking as a number of hck half periods</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_JDI_BXBLANKING</name>
	<description>Horizontal back blanking as a number of hck half periods</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_FBY_BLANKING_REG</name>
	<description>Vertical front/back blanking (vck half periods)</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_FYBLANKING</name>
	<description>Vertical front blanking as a number of vck half periods</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_JDI_BYBLANKING</name>
	<description>Vertical back blanking as a number of vck half periods</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_HCK_WIDTH_REG</name>
	<description>HCK high/low width</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_HCK_WIDTH</name>
	<description>Number of format pipeline clock cycles that define the half period of the of the HCK (high and low width). The minimum allowed value is 2.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_HST_DELAY_REG</name>
	<description>VCK-to-HST delay</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_HST_DELAY</name>
	<description>VCK-to-HST delay in format pipeline clock cycles</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_HST_WIDTH_REG</name>
	<description>HST width</description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_HST_WIDTH</name>
	<description>HST width in format pipeline clock cycles</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_RESXY_REG</name>
	<description>Resolution XY for the JDI parallel I/F</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_RES_X</name>
	<description>Number of horizontal transfers. Should be equal to the half of the horizontal resolution (in pixels).</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_JDI_RES_Y</name>
	<description>Number of vertical transfers. Should be equal to the double of the vertical resolution (in lines). </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_VCK_DELAY_REG</name>
	<description>XRST-to-VCK delay</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_VCK_DELAY</name>
	<description>XRST-to-VCK delay in format pipeline clock cycles</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_VST_DELAY_REG</name>
	<description>XRST-to-VST delay</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_VST_DELAY</name>
	<description>XRST-to-VST delay in format pipeline clock cycles</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_VST_WIDTH_REG</name>
	<description>VST width</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_VST_WIDTH</name>
	<description>VST width in format pipeline clock cycles</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_JDI_XRST_WIDTH_REG</name>
	<description>XRST width</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_XRST_WIDTH</name>
	<description>Number of format pipeline clock cycles of XRST width</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_BASEADDR_REG</name>
	<description>Layer0 Base Addr</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_FB_ADDR</name>
	<description>Base Address of the frame buffer</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_MODE_REG</name>
	<description>Layer0 Mode</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_EN</name>
	<description>Enable layer.
0 : disable
1 : enable</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_COLOUR_MODE</name>
	<description>Colour Mode:
00001: 16-bit RGBX5551 color format,
00010: 32-bit RGBX8888 color format,
00100: 8-bit RGB332 color format,
00101: 16-bit RGB565 color format,
00110: 32-bit XRGB8888,
00111: L8 Grayscale/Palette format,
01000: L1 Grayscale/Palette format,
01001: L4 Grayscale/Palette format,
01101: ABGR8888,
01110: BGRA8888</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_OFFSETX_REG</name>
	<description>Layer0 OffsetX and DMA prefetch</description>
	<addressOffset>0x00000188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_DMA_PREFETCH</name>
	<description>DMA fifo prefetch level (range: 0-4)
0x0 : Prefetch mechanism is disabled
0x1 : Prefetch at least 44 bytes
0x2 : Prefetch at least 84 bytes
0x3 : Prefetch at least 116 bytes
0x4 : Prefetch at least 108 bytes
Any other value : Reserved</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_OFFSETX</name>
	<description>Offset X (negative) of X start pixel (range [n-1,0], n : pixels /8)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_RESXY_REG</name>
	<description>Layer0 Res XY</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_RES_X</name>
	<description>Resolution X (Resolution of layer in pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_RES_Y</name>
	<description>Resolution Y (Resolution of layer in pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_SIZEXY_REG</name>
	<description>Layer0 Size XY</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_SIZE_X</name>
	<description>Size X (Size of layer in pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_SIZE_Y</name>
	<description>Size Y (Size of layer in pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_STARTXY_REG</name>
	<description>Layer0 Start XY</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_START_X</name>
	<description>Start X (offset pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_START_Y</name>
	<description>Start Y (offset pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_STRIDE_REG</name>
	<description>Layer0 Stride</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_L0_FIFO_THR</name>
	<description>Layer dma fifo threshold burst start
00: half fifo (default)
01: 2 burst size
10: 4 burst size
11: 8 burst size</description>
	<bitRange>[20:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_BURST_LEN</name>
	<description>Layer burst length
000: 16-beats (default)
001: 2-beats
010: 4-beats
011: 8-beats
100: 16-beats</description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_L0_STRIDE</name>
	<description>Layer Stride (distance from line to line in bytes)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_MODE_REG</name>
	<description>Display Mode</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_MODE_EN</name>
	<description>Mode register.
0 : disable
1 : enable</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_VSYNC_POL</name>
	<description>VSYNC polarity.
0: positive
1: negative</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_HSYNC_POL</name>
	<description>HSYNC polarity.
0: positive
1: negative</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DE_POL</name>
	<description>DE polarity.
0: positive
1: negative</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_VSYNC_SCPL</name>
	<description>Set VSYNC for a single cycle per line.
0: disable
1: enable</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_PIXCLKOUT_POL</name>
	<description>Pixel clock out polarity.
0: positive
1: negative</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_FORCE_BLANK</name>
	<description>Forces output to blank.
0: disable
1: enable</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_SFRAME_UPD</name>
	<description>Single frame update.
0: disable
1: enable</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_PIXCLKOUT_SEL</name>
	<description>Selects the pixel out clock for the display.
0: based on the pixel pipeline clock
1: based on the format pipeline clock
See also the LCDC_CLKCTRL_REG.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_OUT_MODE</name>
	<description>Selection of the output mode
0000: Parallel RGB
1000: JDI MIP
All the other values are reserved.</description>
	<bitRange>[8:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_MIPI_OFF</name>
	<description>MIPI off. (SPI mode of MIPI standard)
0: disabled
1: enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_FORM_OFF</name>
	<description>Formating off
0: disabled
1: enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DSCAN</name>
	<description>Double horizontal scan
0: disabled
1: enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_TMODE</name>
	<description>Test mode
0: disabled
1: enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_RESXY_REG</name>
	<description>Resolution X,Y</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_RES_X</name>
	<description>Resolution X in pixels.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_RES_Y</name>
	<description>Resolution Y in pixels.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_STATUS_REG</name>
	<description>Status Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_JDI_TIM_SW_RST</name>
	<description>JDI timing generation soft reset (active high)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_FRAME_START</name>
	<description>Frame start (active high)</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_FRAME_END</name>
	<description>Frame end (active high)</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_DBIB_CMD_PENDING</name>
	<description>Transferring of command in progress.
0: idle
1: in progress</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_DBIB_CMD_FIFO_FULL</name>
	<description>Command fifo full indication.
0: is not full
1: is full</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_DBIB_CMD_FIFO_EMPTY_N</name>
	<description>Command fifo empty indication (negative)
0: the fifo is empty
1: the fifo is not empty</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_DBIB_TE</name>
	<description>The DBIB tearing effect signal</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_STICKY_UNDERFLOW</name>
	<description>Sticky underflow(clear with write in the LCDC_INTERRUPT_REG)
0: There is no underflow
1: Underflow has been detected.Remains high until to be cleared by performing a write access on the register LCDC_INTERRUPT_REG.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_UNDERFLOW</name>
	<description>Underflow on the current transfer.
0: There is no underflow
1: Underflow has been detected. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_LAST_ROW</name>
	<description>Last row (Last row is currently displayed)</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_STAT_CSYNC</name>
	<description>CSYNC signal level</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_STAT_VSYNC</name>
	<description>VSYNC signal level</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_STAT_HSYNC</name>
	<description>HSYNC signal level</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_FRAMEGEN_BUSY</name>
	<description>The frame generator is busy (active high).</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LCDC_STAT_ACTIVE</name>
	<description>Active (When not in vertical blanking)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>LRA</name>
	<version>1.0</version>
	<description>LRA registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030a00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>92</size>
	<usage>registers</usage>
</addressBlock>
	
